#include <stdio.h>

int main() {//Написать программу выводящую на экран первые NN натуральных чисел.
    int N,k;
   scanf ("%d",&N);
    for (int k=1; k<=N;k++)
    {printf("%d ",k);
    }
    return 0;
}