#include <stdio.h>

int main() {//Написать программу для перевод символов в верхний регистр.
char ch;
scanf ("%c", &ch);
printf ("%c", ch-32);
  return 0;
}